#include <iostream>

using namespace std;

int main() {
    cout << "Лабораторна робота №1 (задача 3) гр.319а Заставського Назара" << endl << endl;

    // Вхідні дані
      double a, b;

    // Введення розмірів прямокутника
    cout << "Введіть ширину та довжину прямокутника a та b: ";
    cin >> a >> b;

    // Обчислення площі та периметра прямокутника
    double S = a * b;
    double P = 2 * (a + b);

    // Виведення отриманих результатів
    cout << "Площа прямокутника S = " << S << endl;
    cout << "Периметр прямокутника P = " << P << endl;

    return 0;
}