
#include <iostream> 
using namespace std; 
int main() {
cout << "Лабораторна робота №1 (задача № 15) гр.319а Заставського Назара" << endl;
 // Вхідні змінні та початкова змінна 
int A, B, C, t; 
cout << "Введіть значення змінних A, B, C: ";
// Введення значень змінних А, В, С
cin >> A >> B >> C; 
// Перестановка значень (A -> C, C -> B, B -> A)
t = A; A = B; B = C; C = t;
// Виведення нових значень змінних
cout << "Нові значення зміннних :" << endl;
cout << "A = " << A << endl; 
cout << "B = " << B << endl;
cout << "C = " << C << endl;
return 0; }