#include <iostream>
using namespace std; 
int main() 
{ cout << "Лабораторна робота №1 (задача № 26) гр.319а Заставського Назара" << endl;
//Вхідні змінні
double V, U, T1, T2, S; 
//Введення даних 
cout << "Введіть швидкість човна V: "; 
cin >> V; 
cout << "Введіть швидкість течії U: ";
cin >> U; 
cout << "Введіть час руху човна по озеру T1: "; 
cin >> T1; 
cout << "Введіть час руху човна проти течії T2: ";
cin >> T2; 
// Обчислення загального шляху (шлях по озеру + шлях проти течії)
S = V * T1 + (V - U) * T2; 
// Виведення результату
cout << "Човен пройшов шлях S = " << S << endl; 
return 0; }